#include <iostream> // підключаємо бібліотеку для введення та виведення даних
using namespace std; // використовуємо стандартний простір імен std
int main () // головна функція, з якої починається виконання програми
// Це програма на мові C++, яка виконує три математичні задачі: знаходить площу, переводить кілометри в метри та сантиметри і обчислює середнє арифметичне трьох чисел.
{
// Завдання 1 (Begin 42)
// декларація змінних
double d1, d2, S; // d1 і d2 — діагоналі, S — площа
// введення змінних
cout <<"Введіть розмір d1, d2:"; // просимо ввести значення діагоналей
cin >> d1 >> d2; // записуємо введені значення у змінні d1 і d2
// розрахунок результату
S = (d1 * d2) / 2; // обчислюємо площу за формулою
// вивід результату
cout <<"Площа дорівнює:" << S << endl; // виводимо значення площі

// Завдання 2 (Begin38)
// декларація змінних
int km, m, cm; // km — кілометри, m — метри, cm — сантиметри
// введення змінної
cout <<"Вкажіть відстань у кілометрах:"; // просимо ввести відстань
cin >> km; // записуємо введене значення у змінну km
// розрахунок результату
m = km * 1000; // переводимо кілометри у метри
cm = km * 100000; // переводимо кілометри у сантиметри
// вивід результату
cout <<"Відстань у метрах:" << m << endl; // виводимо відстань у метрах
cout <<"Відстань у сантиметрах:" << cm << endl; // виводимо відстань у сантиметрах

// Завдання 3 (Begin34)
// декларація змінних
double a, b, c, x; // a, b, c — числа, x — середнє арифметичне
// введення змінних
cout <<"Введіть дані для a, b, c:";  // просимо ввести три числа
cin >> a >> b >> c; // записуємо введені значення у змінні
// розрахунок результату
x = (a + b + c) / 3; // обчислюємо середнє арифметичне
// вивід результату
cout <<"Середнє арифметичне:" << x << endl; // виводимо результат
return 0; // завершуємо виконання програми
}
